ProgessBase/Documents/ПРГ_ЗапросНапредоставлениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_ЗапросНапредоставлениеДокументов</Name>
			<BasedOn>
				<xr:Item>Document.ПРГ_ЗапросНапредоставлениеДокументов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ВидыЗапосовНаПредоставление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_СтатусыЗапросовНаПредоставление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровереноКК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиваемыйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставленныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПРГ_ЗапросНапредоставлениеДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ПРГ_ЗапросынаПредоставлениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_ЗапросынаПредоставлениеДокументов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗапроса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ВидыЗапосовНаПредоставление</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПРГ_ЗапросНапредоставлениеДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПРГ_СтатусыЗапросовНаПредоставление</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ПРГ_СтатусыЗапросовНаПредоставление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПРГ_СтатусыЗапросовНаПредоставление</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Documents/ПРГ_ЗапросНапредоставлениеДокументов/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей       = РегистрыСведений.ПРГ_ЗапросынаПредоставлениеДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Запрос.Установить(Ссылка);
	НаборЗаписей.Отбор.Статус.Установить(Статус);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НоваяЗапись        = НаборЗаписей.Добавить();
	НоваяЗапись.Запрос  = Ссылка;  
	Если Статус = Перечисления.ПРГ_СтатусыЗапросовНаПредоставление.Открыт Тогда
		НоваяЗапись.Период       = Ссылка.Дата; 
	ИначеЕсли Статус = Перечисления.ПРГ_СтатусыЗапросовНаПредоставление.ВРаботе Тогда
		НоваяЗапись.Период       = ТекущаяДата(); 
	ИначеЕсли Статус = Перечисления.ПРГ_СтатусыЗапросовНаПредоставление.Закрыт Тогда
		НоваяЗапись.Период       = ТекущаяДата(); 
	КонецЕсли;
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.Инициатор = Инициатор;
	НоваяЗапись.Исполнитель = Исполнитель;
	НоваяЗапись.ПредметЗапроса = ПредметЗапроса;
	НоваяЗапись.ВидЗапроса = ВидЗапроса;	
	НоваяЗапись.Статус = Статус;
	НоваяЗапись.Отправлено = Ложь;
	
	НаборЗаписей.Записать(); 

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		НаборЗаписей       = РегистрыСведений.ПРГ_ЗапросынаПредоставлениеДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Запрос.Установить(Ссылка);
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Записать();	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ЭтоНовый() И НЕ Основание = Неопределено И НЕ ТипЗнч(Основание) = Тип("Структура") Тогда
		
		ДокументОснование = Основание;
								
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ЗаполнимПоДаннымОснования(Основание);
	КонецЕсли;
   
КонецПроцедуры
Процедура   ЗаполнимПоДаннымОснования(Основание)
	 ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание, "Исполнитель, Комментарий, ЗапрашиваемыйДокумент, ПредоставленныйДокумент, Склад");

КонецПроцедуры
